# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一筆的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [3]:
# 記得先 Import 正確的套件
import numpy as np
import pandas as pd

In [4]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [6]:
mean_of_animal = df.groupby('animal').mean()
print(mean_of_animal)
order_by_age = mean_of_animal.sort_values(by='age')
print(order_by_age)
order_by_visits = mean_of_animal.sort_values(by='visits')
print(order_by_visits)
df.priority = df.priority.apply(lambda x : True if x=='yes' else False)
print(df)

        age  visits
animal
cat     2.5     2.0
dog     5.0     2.0
snake   2.5     1.5
        age  visits
animal
cat     2.5     2.0
snake   2.5     1.5
dog     5.0     2.0
        age  visits
animal
snake   2.5     1.5
cat     2.5     2.0
dog     5.0     2.0
  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [13]:
df - df.mean()

          0         1         2
0  0.431854  0.149452  0.379958
1 -0.056520 -0.267548 -0.070704
2 -0.279411  0.007085  0.261478
3 -0.091069  0.196294 -0.000053
4 -0.004854 -0.085284 -0.570679

In [16]:
df - df.mean()

          0         1         2
0  0.431854  0.149452  0.379958
1 -0.056520 -0.267548 -0.070704
2 -0.279411  0.007085  0.261478
3 -0.091069  0.196294 -0.000053
4 -0.004854 -0.085284 -0.570679

In [15]:
df.sub(df.mean(axis=1) ,axis=0)

          0         1         2
0  0.004166 -0.269205  0.265039
1 -0.032197 -0.234192  0.266389
2 -0.383062 -0.087535  0.470596
3 -0.233394  0.063001  0.170392
4  0.108152  0.036753 -0.144905

### 3. 承上題，請問：

1) 哪一筆的資料總合最小
2) 哪一欄位的資料總合最小

In [10]:
df

          0         1         2
0  0.729078  0.455708  0.989951
1  0.240703  0.038708  0.539289
2  0.017813  0.313340  0.871472
3  0.206155  0.502550  0.609941
4  0.292370  0.220971  0.039314

In [17]:
df.sum().argmax()

2

In [12]:
df.sum(axis=1).argmax()

0